app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ?  [["user_id", 2]]
---
	def index
			@clients = current_user.clients.all

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 15], ["LIMIT", 1]]
---
	def show
			@client = current_user.clients.find(params[:id])

INSERT INTO "clients" ("client", "databird", "group", "phone", "email", "address", "city", "country", "comment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@client = current_user.clients.new(client_params)
		if @client.save

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@client = Client.find(params[:id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients" SET "databird" = ?, "phone" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["databird", "01.04.1989"], ["phone", "06310900580"], ["updated_at", 2016-08-29 19:07:45 UTC], ["id", 1]]
---
	def update
		@client = Client.find(params[:id])
		if @client.update(client_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
	def destroy
		@client = current_user.clients.find(params[:id])
		@client.destroy